libxmlbus/data/wsaddr-testset/documents/echo/soap12/message3.xml

<?xml version="1.0"?>
<!-- $Id: message3.xml,v 1.5 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:106BB296-6D77-4E9D-8524-6CB4EACEE721</wsa:MessageID>
    <wsa:FaultTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:FaultTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
